grevaillot/svd_tools/headers/ATSAM3X8H/piof.h
#pragma once 

/* --- PIOF: Parallel Input/Output Controller F --------------------- */

/** @defgroup piof_registers Parallel Input/Output Controller F Register
@{*/

/** PIOF_PER PIO Enable Register **/
#define PIOF_PER			MMIO32(PIOF_BASE + 0x00)
/** PIOF_PDR PIO Disable Register **/
#define PIOF_PDR			MMIO32(PIOF_BASE + 0x04)
/** PIOF_PSR PIO Status Register **/
#define PIOF_PSR			MMIO32(PIOF_BASE + 0x08)
/** PIOF_OER Output Enable Register **/
#define PIOF_OER			MMIO32(PIOF_BASE + 0x10)
/** PIOF_ODR Output Disable Register **/
#define PIOF_ODR			MMIO32(PIOF_BASE + 0x14)
/** PIOF_OSR Output Status Register **/
#define PIOF_OSR			MMIO32(PIOF_BASE + 0x18)
/** PIOF_IFER Glitch Input Filter Enable Register **/
#define PIOF_IFER			MMIO32(PIOF_BASE + 0x20)
/** PIOF_IFDR Glitch Input Filter Disable Register **/
#define PIOF_IFDR			MMIO32(PIOF_BASE + 0x24)
/** PIOF_IFSR Glitch Input Filter Status Register **/
#define PIOF_IFSR			MMIO32(PIOF_BASE + 0x28)
/** PIOF_SODR Set Output Data Register **/
#define PIOF_SODR			MMIO32(PIOF_BASE + 0x30)
/** PIOF_CODR Clear Output Data Register **/
#define PIOF_CODR			MMIO32(PIOF_BASE + 0x34)
/** PIOF_ODSR Output Data Status Register **/
#define PIOF_ODSR			MMIO32(PIOF_BASE + 0x38)
/** PIOF_PDSR Pin Data Status Register **/
#define PIOF_PDSR			MMIO32(PIOF_BASE + 0x3c)
/** PIOF_IER Interrupt Enable Register **/
#define PIOF_IER			MMIO32(PIOF_BASE + 0x40)
/** PIOF_IDR Interrupt Disable Register **/
#define PIOF_IDR			MMIO32(PIOF_BASE + 0x44)
/** PIOF_IMR Interrupt Mask Register **/
#define PIOF_IMR			MMIO32(PIOF_BASE + 0x48)
/** PIOF_ISR Interrupt Status Register **/
#define PIOF_ISR			MMIO32(PIOF_BASE + 0x4c)
/** PIOF_MDER Multi-driver Enable Register **/
#define PIOF_MDER			MMIO32(PIOF_BASE + 0x50)
/** PIOF_MDDR Multi-driver Disable Register **/
#define PIOF_MDDR			MMIO32(PIOF_BASE + 0x54)
/** PIOF_MDSR Multi-driver Status Register **/
#define PIOF_MDSR			MMIO32(PIOF_BASE + 0x58)
/** PIOF_PUDR Pull-up Disable Register **/
#define PIOF_PUDR			MMIO32(PIOF_BASE + 0x60)
/** PIOF_PUER Pull-up Enable Register **/
#define PIOF_PUER			MMIO32(PIOF_BASE + 0x64)
/** PIOF_PUSR Pad Pull-up Status Register **/
#define PIOF_PUSR			MMIO32(PIOF_BASE + 0x68)
/** PIOF_ABSR Peripheral AB Select Register **/
#define PIOF_ABSR			MMIO32(PIOF_BASE + 0x70)
/** PIOF_SCIFSR System Clock Glitch Input Filter Select Register **/
#define PIOF_SCIFSR			MMIO32(PIOF_BASE + 0x80)
/** PIOF_DIFSR Debouncing Input Filter Select Register **/
#define PIOF_DIFSR			MMIO32(PIOF_BASE + 0x84)
/** PIOF_IFDGSR Glitch or Debouncing Input Filter Clock Selection Status Register **/
#define PIOF_IFDGSR			MMIO32(PIOF_BASE + 0x88)
/** PIOF_SCDR Slow Clock Divider Debouncing Register **/
#define PIOF_SCDR			MMIO32(PIOF_BASE + 0x8c)
/** PIOF_OWER Output Write Enable **/
#define PIOF_OWER			MMIO32(PIOF_BASE + 0xa0)
/** PIOF_OWDR Output Write Disable **/
#define PIOF_OWDR			MMIO32(PIOF_BASE + 0xa4)
/** PIOF_OWSR Output Write Status Register **/
#define PIOF_OWSR			MMIO32(PIOF_BASE + 0xa8)
/** PIOF_AIMER Additional Interrupt Modes Enable Register **/
#define PIOF_AIMER			MMIO32(PIOF_BASE + 0xb0)
/** PIOF_AIMDR Additional Interrupt Modes Disables Register **/
#define PIOF_AIMDR			MMIO32(PIOF_BASE + 0xb4)
/** PIOF_AIMMR Additional Interrupt Modes Mask Register **/
#define PIOF_AIMMR			MMIO32(PIOF_BASE + 0xb8)
/** PIOF_ESR Edge Select Register **/
#define PIOF_ESR			MMIO32(PIOF_BASE + 0xc0)
/** PIOF_LSR Level Select Register **/
#define PIOF_LSR			MMIO32(PIOF_BASE + 0xc4)
/** PIOF_ELSR Edge/Level Status Register **/
#define PIOF_ELSR			MMIO32(PIOF_BASE + 0xc8)
/** PIOF_FELLSR Falling Edge/Low Level Select Register **/
#define PIOF_FELLSR			MMIO32(PIOF_BASE + 0xd0)
/** PIOF_REHLSR Rising Edge/ High Level Select Register **/
#define PIOF_REHLSR			MMIO32(PIOF_BASE + 0xd4)
/** PIOF_FRLHSR Fall/Rise - Low/High Status Register **/
#define PIOF_FRLHSR			MMIO32(PIOF_BASE + 0xd8)
/** PIOF_LOCKSR Lock Status **/
#define PIOF_LOCKSR			MMIO32(PIOF_BASE + 0xe0)
/** PIOF_WPMR Write Protect Mode Register **/
#define PIOF_WPMR			MMIO32(PIOF_BASE + 0xe4)
/** PIOF_WPSR Write Protect Status Register **/
#define PIOF_WPSR			MMIO32(PIOF_BASE + 0xe8)

/**@}*/


/** @defgroup piof_per PER PIO Enable Register
@{*/

/** PIOF_PER_P31 PIO Enable **/
#define PIOF_PER_P31		(1 << 31)
/** PIOF_PER_P30 PIO Enable **/
#define PIOF_PER_P30		(1 << 30)
/** PIOF_PER_P29 PIO Enable **/
#define PIOF_PER_P29		(1 << 29)
/** PIOF_PER_P28 PIO Enable **/
#define PIOF_PER_P28		(1 << 28)
/** PIOF_PER_P27 PIO Enable **/
#define PIOF_PER_P27		(1 << 27)
/** PIOF_PER_P26 PIO Enable **/
#define PIOF_PER_P26		(1 << 26)
/** PIOF_PER_P25 PIO Enable **/
#define PIOF_PER_P25		(1 << 25)
/** PIOF_PER_P24 PIO Enable **/
#define PIOF_PER_P24		(1 << 24)
/** PIOF_PER_P23 PIO Enable **/
#define PIOF_PER_P23		(1 << 23)
/** PIOF_PER_P22 PIO Enable **/
#define PIOF_PER_P22		(1 << 22)
/** PIOF_PER_P21 PIO Enable **/
#define PIOF_PER_P21		(1 << 21)
/** PIOF_PER_P20 PIO Enable **/
#define PIOF_PER_P20		(1 << 20)
/** PIOF_PER_P19 PIO Enable **/
#define PIOF_PER_P19		(1 << 19)
/** PIOF_PER_P18 PIO Enable **/
#define PIOF_PER_P18		(1 << 18)
/** PIOF_PER_P17 PIO Enable **/
#define PIOF_PER_P17		(1 << 17)
/** PIOF_PER_P16 PIO Enable **/
#define PIOF_PER_P16		(1 << 16)
/** PIOF_PER_P15 PIO Enable **/
#define PIOF_PER_P15		(1 << 15)
/** PIOF_PER_P14 PIO Enable **/
#define PIOF_PER_P14		(1 << 14)
/** PIOF_PER_P13 PIO Enable **/
#define PIOF_PER_P13		(1 << 13)
/** PIOF_PER_P12 PIO Enable **/
#define PIOF_PER_P12		(1 << 12)
/** PIOF_PER_P11 PIO Enable **/
#define PIOF_PER_P11		(1 << 11)
/** PIOF_PER_P10 PIO Enable **/
#define PIOF_PER_P10		(1 << 10)
/** PIOF_PER_P9 PIO Enable **/
#define PIOF_PER_P9		(1 << 9)
/** PIOF_PER_P8 PIO Enable **/
#define PIOF_PER_P8		(1 << 8)
/** PIOF_PER_P7 PIO Enable **/
#define PIOF_PER_P7		(1 << 7)
/** PIOF_PER_P6 PIO Enable **/
#define PIOF_PER_P6		(1 << 6)
/** PIOF_PER_P5 PIO Enable **/
#define PIOF_PER_P5		(1 << 5)
/** PIOF_PER_P4 PIO Enable **/
#define PIOF_PER_P4		(1 << 4)
/** PIOF_PER_P3 PIO Enable **/
#define PIOF_PER_P3		(1 << 3)
/** PIOF_PER_P2 PIO Enable **/
#define PIOF_PER_P2		(1 << 2)
/** PIOF_PER_P1 PIO Enable **/
#define PIOF_PER_P1		(1 << 1)
/** PIOF_PER_P0 PIO Enable **/
#define PIOF_PER_P0		(1 << 0)

/**@}*/

/** @defgroup piof_pdr PDR PIO Disable Register
@{*/

