grevaillot/svd_tools/headers/ATSAM3X8H/piof.h
/** PIOF_MDDR_P31 Multi Drive Disable. **/
#define PIOF_MDDR_P31		(1 << 31)
/** PIOF_MDDR_P30 Multi Drive Disable. **/
#define PIOF_MDDR_P30		(1 << 30)
/** PIOF_MDDR_P29 Multi Drive Disable. **/
#define PIOF_MDDR_P29		(1 << 29)
/** PIOF_MDDR_P28 Multi Drive Disable. **/
#define PIOF_MDDR_P28		(1 << 28)
/** PIOF_MDDR_P27 Multi Drive Disable. **/
#define PIOF_MDDR_P27		(1 << 27)
/** PIOF_MDDR_P26 Multi Drive Disable. **/
#define PIOF_MDDR_P26		(1 << 26)
/** PIOF_MDDR_P25 Multi Drive Disable. **/
#define PIOF_MDDR_P25		(1 << 25)
/** PIOF_MDDR_P24 Multi Drive Disable. **/
#define PIOF_MDDR_P24		(1 << 24)
/** PIOF_MDDR_P23 Multi Drive Disable. **/
#define PIOF_MDDR_P23		(1 << 23)
/** PIOF_MDDR_P22 Multi Drive Disable. **/
#define PIOF_MDDR_P22		(1 << 22)
/** PIOF_MDDR_P21 Multi Drive Disable. **/
#define PIOF_MDDR_P21		(1 << 21)
/** PIOF_MDDR_P20 Multi Drive Disable. **/
#define PIOF_MDDR_P20		(1 << 20)
/** PIOF_MDDR_P19 Multi Drive Disable. **/
#define PIOF_MDDR_P19		(1 << 19)
/** PIOF_MDDR_P18 Multi Drive Disable. **/
#define PIOF_MDDR_P18		(1 << 18)
/** PIOF_MDDR_P17 Multi Drive Disable. **/
#define PIOF_MDDR_P17		(1 << 17)
/** PIOF_MDDR_P16 Multi Drive Disable. **/
#define PIOF_MDDR_P16		(1 << 16)
/** PIOF_MDDR_P15 Multi Drive Disable. **/
#define PIOF_MDDR_P15		(1 << 15)
/** PIOF_MDDR_P14 Multi Drive Disable. **/
#define PIOF_MDDR_P14		(1 << 14)
/** PIOF_MDDR_P13 Multi Drive Disable. **/
#define PIOF_MDDR_P13		(1 << 13)
/** PIOF_MDDR_P12 Multi Drive Disable. **/
#define PIOF_MDDR_P12		(1 << 12)
/** PIOF_MDDR_P11 Multi Drive Disable. **/
#define PIOF_MDDR_P11		(1 << 11)
/** PIOF_MDDR_P10 Multi Drive Disable. **/
#define PIOF_MDDR_P10		(1 << 10)
/** PIOF_MDDR_P9 Multi Drive Disable. **/
#define PIOF_MDDR_P9		(1 << 9)
/** PIOF_MDDR_P8 Multi Drive Disable. **/
#define PIOF_MDDR_P8		(1 << 8)
/** PIOF_MDDR_P7 Multi Drive Disable. **/
#define PIOF_MDDR_P7		(1 << 7)
/** PIOF_MDDR_P6 Multi Drive Disable. **/
#define PIOF_MDDR_P6		(1 << 6)
/** PIOF_MDDR_P5 Multi Drive Disable. **/
#define PIOF_MDDR_P5		(1 << 5)
/** PIOF_MDDR_P4 Multi Drive Disable. **/
#define PIOF_MDDR_P4		(1 << 4)
/** PIOF_MDDR_P3 Multi Drive Disable. **/
#define PIOF_MDDR_P3		(1 << 3)
/** PIOF_MDDR_P2 Multi Drive Disable. **/
#define PIOF_MDDR_P2		(1 << 2)
/** PIOF_MDDR_P1 Multi Drive Disable. **/
#define PIOF_MDDR_P1		(1 << 1)
/** PIOF_MDDR_P0 Multi Drive Disable. **/
#define PIOF_MDDR_P0		(1 << 0)

/**@}*/

/** @defgroup piof_mdsr MDSR Multi-driver Status Register
@{*/

/** PIOF_MDSR_P31 Multi Drive Status. **/
#define PIOF_MDSR_P31		(1 << 31)
/** PIOF_MDSR_P30 Multi Drive Status. **/
#define PIOF_MDSR_P30		(1 << 30)
/** PIOF_MDSR_P29 Multi Drive Status. **/
#define PIOF_MDSR_P29		(1 << 29)
/** PIOF_MDSR_P28 Multi Drive Status. **/
#define PIOF_MDSR_P28		(1 << 28)
/** PIOF_MDSR_P27 Multi Drive Status. **/
#define PIOF_MDSR_P27		(1 << 27)
/** PIOF_MDSR_P26 Multi Drive Status. **/
#define PIOF_MDSR_P26		(1 << 26)
/** PIOF_MDSR_P25 Multi Drive Status. **/
#define PIOF_MDSR_P25		(1 << 25)
/** PIOF_MDSR_P24 Multi Drive Status. **/
#define PIOF_MDSR_P24		(1 << 24)
/** PIOF_MDSR_P23 Multi Drive Status. **/
#define PIOF_MDSR_P23		(1 << 23)
/** PIOF_MDSR_P22 Multi Drive Status. **/
#define PIOF_MDSR_P22		(1 << 22)
/** PIOF_MDSR_P21 Multi Drive Status. **/
#define PIOF_MDSR_P21		(1 << 21)
/** PIOF_MDSR_P20 Multi Drive Status. **/
#define PIOF_MDSR_P20		(1 << 20)
/** PIOF_MDSR_P19 Multi Drive Status. **/
#define PIOF_MDSR_P19		(1 << 19)
/** PIOF_MDSR_P18 Multi Drive Status. **/
#define PIOF_MDSR_P18		(1 << 18)
/** PIOF_MDSR_P17 Multi Drive Status. **/
#define PIOF_MDSR_P17		(1 << 17)
/** PIOF_MDSR_P16 Multi Drive Status. **/
#define PIOF_MDSR_P16		(1 << 16)
/** PIOF_MDSR_P15 Multi Drive Status. **/
#define PIOF_MDSR_P15		(1 << 15)
/** PIOF_MDSR_P14 Multi Drive Status. **/
#define PIOF_MDSR_P14		(1 << 14)
/** PIOF_MDSR_P13 Multi Drive Status. **/
#define PIOF_MDSR_P13		(1 << 13)
/** PIOF_MDSR_P12 Multi Drive Status. **/
#define PIOF_MDSR_P12		(1 << 12)
/** PIOF_MDSR_P11 Multi Drive Status. **/
#define PIOF_MDSR_P11		(1 << 11)
/** PIOF_MDSR_P10 Multi Drive Status. **/
#define PIOF_MDSR_P10		(1 << 10)
/** PIOF_MDSR_P9 Multi Drive Status. **/
#define PIOF_MDSR_P9		(1 << 9)
/** PIOF_MDSR_P8 Multi Drive Status. **/
#define PIOF_MDSR_P8		(1 << 8)
/** PIOF_MDSR_P7 Multi Drive Status. **/
#define PIOF_MDSR_P7		(1 << 7)
/** PIOF_MDSR_P6 Multi Drive Status. **/
#define PIOF_MDSR_P6		(1 << 6)
/** PIOF_MDSR_P5 Multi Drive Status. **/
#define PIOF_MDSR_P5		(1 << 5)
/** PIOF_MDSR_P4 Multi Drive Status. **/
#define PIOF_MDSR_P4		(1 << 4)
/** PIOF_MDSR_P3 Multi Drive Status. **/
#define PIOF_MDSR_P3		(1 << 3)
/** PIOF_MDSR_P2 Multi Drive Status. **/
#define PIOF_MDSR_P2		(1 << 2)
/** PIOF_MDSR_P1 Multi Drive Status. **/
#define PIOF_MDSR_P1		(1 << 1)
/** PIOF_MDSR_P0 Multi Drive Status. **/
#define PIOF_MDSR_P0		(1 << 0)

/**@}*/

/** @defgroup piof_pudr PUDR Pull-up Disable Register
@{*/

/** PIOF_PUDR_P31 Pull Up Disable. **/
#define PIOF_PUDR_P31		(1 << 31)
/** PIOF_PUDR_P30 Pull Up Disable. **/
#define PIOF_PUDR_P30		(1 << 30)
/** PIOF_PUDR_P29 Pull Up Disable. **/
#define PIOF_PUDR_P29		(1 << 29)
/** PIOF_PUDR_P28 Pull Up Disable. **/
#define PIOF_PUDR_P28		(1 << 28)
/** PIOF_PUDR_P27 Pull Up Disable. **/
#define PIOF_PUDR_P27		(1 << 27)
/** PIOF_PUDR_P26 Pull Up Disable. **/
#define PIOF_PUDR_P26		(1 << 26)
/** PIOF_PUDR_P25 Pull Up Disable. **/
#define PIOF_PUDR_P25		(1 << 25)
/** PIOF_PUDR_P24 Pull Up Disable. **/
#define PIOF_PUDR_P24		(1 << 24)
/** PIOF_PUDR_P23 Pull Up Disable. **/
#define PIOF_PUDR_P23		(1 << 23)
/** PIOF_PUDR_P22 Pull Up Disable. **/
#define PIOF_PUDR_P22		(1 << 22)
/** PIOF_PUDR_P21 Pull Up Disable. **/
#define PIOF_PUDR_P21		(1 << 21)
/** PIOF_PUDR_P20 Pull Up Disable. **/
#define PIOF_PUDR_P20		(1 << 20)
/** PIOF_PUDR_P19 Pull Up Disable. **/
#define PIOF_PUDR_P19		(1 << 19)
/** PIOF_PUDR_P18 Pull Up Disable. **/
#define PIOF_PUDR_P18		(1 << 18)
/** PIOF_PUDR_P17 Pull Up Disable. **/
#define PIOF_PUDR_P17		(1 << 17)
/** PIOF_PUDR_P16 Pull Up Disable. **/
#define PIOF_PUDR_P16		(1 << 16)
/** PIOF_PUDR_P15 Pull Up Disable. **/
#define PIOF_PUDR_P15		(1 << 15)
/** PIOF_PUDR_P14 Pull Up Disable. **/
#define PIOF_PUDR_P14		(1 << 14)
/** PIOF_PUDR_P13 Pull Up Disable. **/
#define PIOF_PUDR_P13		(1 << 13)
/** PIOF_PUDR_P12 Pull Up Disable. **/
#define PIOF_PUDR_P12		(1 << 12)
/** PIOF_PUDR_P11 Pull Up Disable. **/
#define PIOF_PUDR_P11		(1 << 11)
/** PIOF_PUDR_P10 Pull Up Disable. **/
#define PIOF_PUDR_P10		(1 << 10)
/** PIOF_PUDR_P9 Pull Up Disable. **/
#define PIOF_PUDR_P9		(1 << 9)
/** PIOF_PUDR_P8 Pull Up Disable. **/
#define PIOF_PUDR_P8		(1 << 8)
/** PIOF_PUDR_P7 Pull Up Disable. **/
#define PIOF_PUDR_P7		(1 << 7)
/** PIOF_PUDR_P6 Pull Up Disable. **/
#define PIOF_PUDR_P6		(1 << 6)
/** PIOF_PUDR_P5 Pull Up Disable. **/
#define PIOF_PUDR_P5		(1 << 5)
/** PIOF_PUDR_P4 Pull Up Disable. **/
#define PIOF_PUDR_P4		(1 << 4)
/** PIOF_PUDR_P3 Pull Up Disable. **/
#define PIOF_PUDR_P3		(1 << 3)
/** PIOF_PUDR_P2 Pull Up Disable. **/
#define PIOF_PUDR_P2		(1 << 2)
/** PIOF_PUDR_P1 Pull Up Disable. **/
#define PIOF_PUDR_P1		(1 << 1)
/** PIOF_PUDR_P0 Pull Up Disable. **/
#define PIOF_PUDR_P0		(1 << 0)

/**@}*/

/** @defgroup piof_puer PUER Pull-up Enable Register
@{*/

/** PIOF_PUER_P31 Pull Up Enable. **/
#define PIOF_PUER_P31		(1 << 31)
/** PIOF_PUER_P30 Pull Up Enable. **/
#define PIOF_PUER_P30		(1 << 30)
/** PIOF_PUER_P29 Pull Up Enable. **/
#define PIOF_PUER_P29		(1 << 29)
/** PIOF_PUER_P28 Pull Up Enable. **/
#define PIOF_PUER_P28		(1 << 28)
/** PIOF_PUER_P27 Pull Up Enable. **/
#define PIOF_PUER_P27		(1 << 27)
/** PIOF_PUER_P26 Pull Up Enable. **/
#define PIOF_PUER_P26		(1 << 26)
/** PIOF_PUER_P25 Pull Up Enable. **/
#define PIOF_PUER_P25		(1 << 25)
/** PIOF_PUER_P24 Pull Up Enable. **/
#define PIOF_PUER_P24		(1 << 24)
/** PIOF_PUER_P23 Pull Up Enable. **/
#define PIOF_PUER_P23		(1 << 23)
/** PIOF_PUER_P22 Pull Up Enable. **/
#define PIOF_PUER_P22		(1 << 22)
/** PIOF_PUER_P21 Pull Up Enable. **/
#define PIOF_PUER_P21		(1 << 21)
/** PIOF_PUER_P20 Pull Up Enable. **/
#define PIOF_PUER_P20		(1 << 20)
/** PIOF_PUER_P19 Pull Up Enable. **/
#define PIOF_PUER_P19		(1 << 19)
/** PIOF_PUER_P18 Pull Up Enable. **/
#define PIOF_PUER_P18		(1 << 18)
/** PIOF_PUER_P17 Pull Up Enable. **/
#define PIOF_PUER_P17		(1 << 17)
/** PIOF_PUER_P16 Pull Up Enable. **/
#define PIOF_PUER_P16		(1 << 16)
/** PIOF_PUER_P15 Pull Up Enable. **/
#define PIOF_PUER_P15		(1 << 15)
/** PIOF_PUER_P14 Pull Up Enable. **/
#define PIOF_PUER_P14		(1 << 14)
/** PIOF_PUER_P13 Pull Up Enable. **/
#define PIOF_PUER_P13		(1 << 13)
/** PIOF_PUER_P12 Pull Up Enable. **/
#define PIOF_PUER_P12		(1 << 12)
/** PIOF_PUER_P11 Pull Up Enable. **/
#define PIOF_PUER_P11		(1 << 11)
/** PIOF_PUER_P10 Pull Up Enable. **/
#define PIOF_PUER_P10		(1 << 10)
/** PIOF_PUER_P9 Pull Up Enable. **/
#define PIOF_PUER_P9		(1 << 9)
/** PIOF_PUER_P8 Pull Up Enable. **/
#define PIOF_PUER_P8		(1 << 8)
/** PIOF_PUER_P7 Pull Up Enable. **/
#define PIOF_PUER_P7		(1 << 7)
/** PIOF_PUER_P6 Pull Up Enable. **/
#define PIOF_PUER_P6		(1 << 6)
/** PIOF_PUER_P5 Pull Up Enable. **/
#define PIOF_PUER_P5		(1 << 5)
/** PIOF_PUER_P4 Pull Up Enable. **/
#define PIOF_PUER_P4		(1 << 4)
/** PIOF_PUER_P3 Pull Up Enable. **/
#define PIOF_PUER_P3		(1 << 3)
/** PIOF_PUER_P2 Pull Up Enable. **/
#define PIOF_PUER_P2		(1 << 2)
/** PIOF_PUER_P1 Pull Up Enable. **/
#define PIOF_PUER_P1		(1 << 1)
/** PIOF_PUER_P0 Pull Up Enable. **/
#define PIOF_PUER_P0		(1 << 0)

/**@}*/

/** @defgroup piof_pusr PUSR Pad Pull-up Status Register
@{*/

/** PIOF_PUSR_P31 Pull Up Status. **/
#define PIOF_PUSR_P31		(1 << 31)
/** PIOF_PUSR_P30 Pull Up Status. **/
#define PIOF_PUSR_P30		(1 << 30)
/** PIOF_PUSR_P29 Pull Up Status. **/
#define PIOF_PUSR_P29		(1 << 29)
/** PIOF_PUSR_P28 Pull Up Status. **/
#define PIOF_PUSR_P28		(1 << 28)
/** PIOF_PUSR_P27 Pull Up Status. **/
#define PIOF_PUSR_P27		(1 << 27)
/** PIOF_PUSR_P26 Pull Up Status. **/
#define PIOF_PUSR_P26		(1 << 26)
/** PIOF_PUSR_P25 Pull Up Status. **/
#define PIOF_PUSR_P25		(1 << 25)
/** PIOF_PUSR_P24 Pull Up Status. **/
#define PIOF_PUSR_P24		(1 << 24)
/** PIOF_PUSR_P23 Pull Up Status. **/
#define PIOF_PUSR_P23		(1 << 23)
/** PIOF_PUSR_P22 Pull Up Status. **/
#define PIOF_PUSR_P22		(1 << 22)
/** PIOF_PUSR_P21 Pull Up Status. **/
#define PIOF_PUSR_P21		(1 << 21)
/** PIOF_PUSR_P20 Pull Up Status. **/
#define PIOF_PUSR_P20		(1 << 20)
/** PIOF_PUSR_P19 Pull Up Status. **/
#define PIOF_PUSR_P19		(1 << 19)
/** PIOF_PUSR_P18 Pull Up Status. **/
#define PIOF_PUSR_P18		(1 << 18)
/** PIOF_PUSR_P17 Pull Up Status. **/
#define PIOF_PUSR_P17		(1 << 17)
/** PIOF_PUSR_P16 Pull Up Status. **/
#define PIOF_PUSR_P16		(1 << 16)
/** PIOF_PUSR_P15 Pull Up Status. **/
#define PIOF_PUSR_P15		(1 << 15)
/** PIOF_PUSR_P14 Pull Up Status. **/
#define PIOF_PUSR_P14		(1 << 14)
/** PIOF_PUSR_P13 Pull Up Status. **/
#define PIOF_PUSR_P13		(1 << 13)
/** PIOF_PUSR_P12 Pull Up Status. **/
#define PIOF_PUSR_P12		(1 << 12)
/** PIOF_PUSR_P11 Pull Up Status. **/
#define PIOF_PUSR_P11		(1 << 11)
/** PIOF_PUSR_P10 Pull Up Status. **/
#define PIOF_PUSR_P10		(1 << 10)
/** PIOF_PUSR_P9 Pull Up Status. **/
#define PIOF_PUSR_P9		(1 << 9)
/** PIOF_PUSR_P8 Pull Up Status. **/
#define PIOF_PUSR_P8		(1 << 8)
/** PIOF_PUSR_P7 Pull Up Status. **/
#define PIOF_PUSR_P7		(1 << 7)
/** PIOF_PUSR_P6 Pull Up Status. **/
#define PIOF_PUSR_P6		(1 << 6)
/** PIOF_PUSR_P5 Pull Up Status. **/
#define PIOF_PUSR_P5		(1 << 5)
/** PIOF_PUSR_P4 Pull Up Status. **/
#define PIOF_PUSR_P4		(1 << 4)
/** PIOF_PUSR_P3 Pull Up Status. **/
#define PIOF_PUSR_P3		(1 << 3)
/** PIOF_PUSR_P2 Pull Up Status. **/
#define PIOF_PUSR_P2		(1 << 2)
/** PIOF_PUSR_P1 Pull Up Status. **/
#define PIOF_PUSR_P1		(1 << 1)
/** PIOF_PUSR_P0 Pull Up Status. **/
#define PIOF_PUSR_P0		(1 << 0)

/**@}*/

/** @defgroup piof_absr ABSR Peripheral AB Select Register
@{*/

/** PIOF_ABSR_P31 Peripheral A Select. **/
#define PIOF_ABSR_P31		(1 << 31)
/** PIOF_ABSR_P30 Peripheral A Select. **/
#define PIOF_ABSR_P30		(1 << 30)
/** PIOF_ABSR_P29 Peripheral A Select. **/
#define PIOF_ABSR_P29		(1 << 29)
/** PIOF_ABSR_P28 Peripheral A Select. **/
#define PIOF_ABSR_P28		(1 << 28)
/** PIOF_ABSR_P27 Peripheral A Select. **/
#define PIOF_ABSR_P27		(1 << 27)
/** PIOF_ABSR_P26 Peripheral A Select. **/
#define PIOF_ABSR_P26		(1 << 26)
/** PIOF_ABSR_P25 Peripheral A Select. **/
#define PIOF_ABSR_P25		(1 << 25)
/** PIOF_ABSR_P24 Peripheral A Select. **/
#define PIOF_ABSR_P24		(1 << 24)
/** PIOF_ABSR_P23 Peripheral A Select. **/
#define PIOF_ABSR_P23		(1 << 23)
/** PIOF_ABSR_P22 Peripheral A Select. **/
#define PIOF_ABSR_P22		(1 << 22)
/** PIOF_ABSR_P21 Peripheral A Select. **/
#define PIOF_ABSR_P21		(1 << 21)
/** PIOF_ABSR_P20 Peripheral A Select. **/
#define PIOF_ABSR_P20		(1 << 20)
/** PIOF_ABSR_P19 Peripheral A Select. **/
#define PIOF_ABSR_P19		(1 << 19)
/** PIOF_ABSR_P18 Peripheral A Select. **/
#define PIOF_ABSR_P18		(1 << 18)
/** PIOF_ABSR_P17 Peripheral A Select. **/
#define PIOF_ABSR_P17		(1 << 17)
/** PIOF_ABSR_P16 Peripheral A Select. **/
#define PIOF_ABSR_P16		(1 << 16)
/** PIOF_ABSR_P15 Peripheral A Select. **/
#define PIOF_ABSR_P15		(1 << 15)
/** PIOF_ABSR_P14 Peripheral A Select. **/
#define PIOF_ABSR_P14		(1 << 14)
/** PIOF_ABSR_P13 Peripheral A Select. **/
#define PIOF_ABSR_P13		(1 << 13)
/** PIOF_ABSR_P12 Peripheral A Select. **/
#define PIOF_ABSR_P12		(1 << 12)
/** PIOF_ABSR_P11 Peripheral A Select. **/
#define PIOF_ABSR_P11		(1 << 11)
/** PIOF_ABSR_P10 Peripheral A Select. **/
#define PIOF_ABSR_P10		(1 << 10)
/** PIOF_ABSR_P9 Peripheral A Select. **/
#define PIOF_ABSR_P9		(1 << 9)
/** PIOF_ABSR_P8 Peripheral A Select. **/
#define PIOF_ABSR_P8		(1 << 8)
/** PIOF_ABSR_P7 Peripheral A Select. **/
#define PIOF_ABSR_P7		(1 << 7)
/** PIOF_ABSR_P6 Peripheral A Select. **/
#define PIOF_ABSR_P6		(1 << 6)
/** PIOF_ABSR_P5 Peripheral A Select. **/
#define PIOF_ABSR_P5		(1 << 5)
/** PIOF_ABSR_P4 Peripheral A Select. **/
#define PIOF_ABSR_P4		(1 << 4)
/** PIOF_ABSR_P3 Peripheral A Select. **/
#define PIOF_ABSR_P3		(1 << 3)
/** PIOF_ABSR_P2 Peripheral A Select. **/
#define PIOF_ABSR_P2		(1 << 2)
/** PIOF_ABSR_P1 Peripheral A Select. **/
#define PIOF_ABSR_P1		(1 << 1)
/** PIOF_ABSR_P0 Peripheral A Select. **/
#define PIOF_ABSR_P0		(1 << 0)

/**@}*/

/** @defgroup piof_scifsr SCIFSR System Clock Glitch Input Filter Select Register
@{*/

/** PIOF_SCIFSR_P31 System Clock Glitch Filtering Select. **/
#define PIOF_SCIFSR_P31		(1 << 31)
/** PIOF_SCIFSR_P30 System Clock Glitch Filtering Select. **/
#define PIOF_SCIFSR_P30		(1 << 30)
/** PIOF_SCIFSR_P29 System Clock Glitch Filtering Select. **/
#define PIOF_SCIFSR_P29		(1 << 29)
/** PIOF_SCIFSR_P28 System Clock Glitch Filtering Select. **/
#define PIOF_SCIFSR_P28		(1 << 28)
/** PIOF_SCIFSR_P27 System Clock Glitch Filtering Select. **/
#define PIOF_SCIFSR_P27		(1 << 27)
/** PIOF_SCIFSR_P26 System Clock Glitch Filtering Select. **/
#define PIOF_SCIFSR_P26		(1 << 26)
/** PIOF_SCIFSR_P25 System Clock Glitch Filtering Select. **/
#define PIOF_SCIFSR_P25		(1 << 25)
/** PIOF_SCIFSR_P24 System Clock Glitch Filtering Select. **/
#define PIOF_SCIFSR_P24		(1 << 24)
/** PIOF_SCIFSR_P23 System Clock Glitch Filtering Select. **/
#define PIOF_SCIFSR_P23		(1 << 23)
/** PIOF_SCIFSR_P22 System Clock Glitch Filtering Select. **/
#define PIOF_SCIFSR_P22		(1 << 22)
/** PIOF_SCIFSR_P21 System Clock Glitch Filtering Select. **/
#define PIOF_SCIFSR_P21		(1 << 21)
/** PIOF_SCIFSR_P20 System Clock Glitch Filtering Select. **/
#define PIOF_SCIFSR_P20		(1 << 20)
/** PIOF_SCIFSR_P19 System Clock Glitch Filtering Select. **/
#define PIOF_SCIFSR_P19		(1 << 19)
/** PIOF_SCIFSR_P18 System Clock Glitch Filtering Select. **/
#define PIOF_SCIFSR_P18		(1 << 18)
/** PIOF_SCIFSR_P17 System Clock Glitch Filtering Select. **/
#define PIOF_SCIFSR_P17		(1 << 17)
/** PIOF_SCIFSR_P16 System Clock Glitch Filtering Select. **/
#define PIOF_SCIFSR_P16		(1 << 16)
/** PIOF_SCIFSR_P15 System Clock Glitch Filtering Select. **/
#define PIOF_SCIFSR_P15		(1 << 15)
/** PIOF_SCIFSR_P14 System Clock Glitch Filtering Select. **/
#define PIOF_SCIFSR_P14		(1 << 14)
/** PIOF_SCIFSR_P13 System Clock Glitch Filtering Select. **/
#define PIOF_SCIFSR_P13		(1 << 13)
/** PIOF_SCIFSR_P12 System Clock Glitch Filtering Select. **/
#define PIOF_SCIFSR_P12		(1 << 12)
/** PIOF_SCIFSR_P11 System Clock Glitch Filtering Select. **/
#define PIOF_SCIFSR_P11		(1 << 11)
/** PIOF_SCIFSR_P10 System Clock Glitch Filtering Select. **/
#define PIOF_SCIFSR_P10		(1 << 10)
/** PIOF_SCIFSR_P9 System Clock Glitch Filtering Select. **/
#define PIOF_SCIFSR_P9		(1 << 9)
/** PIOF_SCIFSR_P8 System Clock Glitch Filtering Select. **/
#define PIOF_SCIFSR_P8		(1 << 8)
/** PIOF_SCIFSR_P7 System Clock Glitch Filtering Select. **/
#define PIOF_SCIFSR_P7		(1 << 7)
/** PIOF_SCIFSR_P6 System Clock Glitch Filtering Select. **/
#define PIOF_SCIFSR_P6		(1 << 6)
/** PIOF_SCIFSR_P5 System Clock Glitch Filtering Select. **/
#define PIOF_SCIFSR_P5		(1 << 5)
/** PIOF_SCIFSR_P4 System Clock Glitch Filtering Select. **/
#define PIOF_SCIFSR_P4		(1 << 4)
/** PIOF_SCIFSR_P3 System Clock Glitch Filtering Select. **/
#define PIOF_SCIFSR_P3		(1 << 3)
/** PIOF_SCIFSR_P2 System Clock Glitch Filtering Select. **/
#define PIOF_SCIFSR_P2		(1 << 2)
/** PIOF_SCIFSR_P1 System Clock Glitch Filtering Select. **/
#define PIOF_SCIFSR_P1		(1 << 1)
/** PIOF_SCIFSR_P0 System Clock Glitch Filtering Select. **/
#define PIOF_SCIFSR_P0		(1 << 0)

/**@}*/

