grevaillot/svd_tools/headers/ATSAM3X8H/piof.h
/** @defgroup piof_difsr DIFSR Debouncing Input Filter Select Register
@{*/

/** PIOF_DIFSR_P31 Debouncing Filtering Select. **/
#define PIOF_DIFSR_P31		(1 << 31)
/** PIOF_DIFSR_P30 Debouncing Filtering Select. **/
#define PIOF_DIFSR_P30		(1 << 30)
/** PIOF_DIFSR_P29 Debouncing Filtering Select. **/
#define PIOF_DIFSR_P29		(1 << 29)
/** PIOF_DIFSR_P28 Debouncing Filtering Select. **/
#define PIOF_DIFSR_P28		(1 << 28)
/** PIOF_DIFSR_P27 Debouncing Filtering Select. **/
#define PIOF_DIFSR_P27		(1 << 27)
/** PIOF_DIFSR_P26 Debouncing Filtering Select. **/
#define PIOF_DIFSR_P26		(1 << 26)
/** PIOF_DIFSR_P25 Debouncing Filtering Select. **/
#define PIOF_DIFSR_P25		(1 << 25)
/** PIOF_DIFSR_P24 Debouncing Filtering Select. **/
#define PIOF_DIFSR_P24		(1 << 24)
/** PIOF_DIFSR_P23 Debouncing Filtering Select. **/
#define PIOF_DIFSR_P23		(1 << 23)
/** PIOF_DIFSR_P22 Debouncing Filtering Select. **/
#define PIOF_DIFSR_P22		(1 << 22)
/** PIOF_DIFSR_P21 Debouncing Filtering Select. **/
#define PIOF_DIFSR_P21		(1 << 21)
/** PIOF_DIFSR_P20 Debouncing Filtering Select. **/
#define PIOF_DIFSR_P20		(1 << 20)
/** PIOF_DIFSR_P19 Debouncing Filtering Select. **/
#define PIOF_DIFSR_P19		(1 << 19)
/** PIOF_DIFSR_P18 Debouncing Filtering Select. **/
#define PIOF_DIFSR_P18		(1 << 18)
/** PIOF_DIFSR_P17 Debouncing Filtering Select. **/
#define PIOF_DIFSR_P17		(1 << 17)
/** PIOF_DIFSR_P16 Debouncing Filtering Select. **/
#define PIOF_DIFSR_P16		(1 << 16)
/** PIOF_DIFSR_P15 Debouncing Filtering Select. **/
#define PIOF_DIFSR_P15		(1 << 15)
/** PIOF_DIFSR_P14 Debouncing Filtering Select. **/
#define PIOF_DIFSR_P14		(1 << 14)
/** PIOF_DIFSR_P13 Debouncing Filtering Select. **/
#define PIOF_DIFSR_P13		(1 << 13)
/** PIOF_DIFSR_P12 Debouncing Filtering Select. **/
#define PIOF_DIFSR_P12		(1 << 12)
/** PIOF_DIFSR_P11 Debouncing Filtering Select. **/
#define PIOF_DIFSR_P11		(1 << 11)
/** PIOF_DIFSR_P10 Debouncing Filtering Select. **/
#define PIOF_DIFSR_P10		(1 << 10)
/** PIOF_DIFSR_P9 Debouncing Filtering Select. **/
#define PIOF_DIFSR_P9		(1 << 9)
/** PIOF_DIFSR_P8 Debouncing Filtering Select. **/
#define PIOF_DIFSR_P8		(1 << 8)
/** PIOF_DIFSR_P7 Debouncing Filtering Select. **/
#define PIOF_DIFSR_P7		(1 << 7)
/** PIOF_DIFSR_P6 Debouncing Filtering Select. **/
#define PIOF_DIFSR_P6		(1 << 6)
/** PIOF_DIFSR_P5 Debouncing Filtering Select. **/
#define PIOF_DIFSR_P5		(1 << 5)
/** PIOF_DIFSR_P4 Debouncing Filtering Select. **/
#define PIOF_DIFSR_P4		(1 << 4)
/** PIOF_DIFSR_P3 Debouncing Filtering Select. **/
#define PIOF_DIFSR_P3		(1 << 3)
/** PIOF_DIFSR_P2 Debouncing Filtering Select. **/
#define PIOF_DIFSR_P2		(1 << 2)
/** PIOF_DIFSR_P1 Debouncing Filtering Select. **/
#define PIOF_DIFSR_P1		(1 << 1)
/** PIOF_DIFSR_P0 Debouncing Filtering Select. **/
#define PIOF_DIFSR_P0		(1 << 0)

/**@}*/

/** @defgroup piof_ifdgsr IFDGSR Glitch or Debouncing Input Filter Clock Selection Status Register
@{*/

/** PIOF_IFDGSR_P31 Glitch or Debouncing Filter Selection Status **/
#define PIOF_IFDGSR_P31		(1 << 31)
/** PIOF_IFDGSR_P30 Glitch or Debouncing Filter Selection Status **/
#define PIOF_IFDGSR_P30		(1 << 30)
/** PIOF_IFDGSR_P29 Glitch or Debouncing Filter Selection Status **/
#define PIOF_IFDGSR_P29		(1 << 29)
/** PIOF_IFDGSR_P28 Glitch or Debouncing Filter Selection Status **/
#define PIOF_IFDGSR_P28		(1 << 28)
/** PIOF_IFDGSR_P27 Glitch or Debouncing Filter Selection Status **/
#define PIOF_IFDGSR_P27		(1 << 27)
/** PIOF_IFDGSR_P26 Glitch or Debouncing Filter Selection Status **/
#define PIOF_IFDGSR_P26		(1 << 26)
/** PIOF_IFDGSR_P25 Glitch or Debouncing Filter Selection Status **/
#define PIOF_IFDGSR_P25		(1 << 25)
/** PIOF_IFDGSR_P24 Glitch or Debouncing Filter Selection Status **/
#define PIOF_IFDGSR_P24		(1 << 24)
/** PIOF_IFDGSR_P23 Glitch or Debouncing Filter Selection Status **/
#define PIOF_IFDGSR_P23		(1 << 23)
/** PIOF_IFDGSR_P22 Glitch or Debouncing Filter Selection Status **/
#define PIOF_IFDGSR_P22		(1 << 22)
/** PIOF_IFDGSR_P21 Glitch or Debouncing Filter Selection Status **/
#define PIOF_IFDGSR_P21		(1 << 21)
/** PIOF_IFDGSR_P20 Glitch or Debouncing Filter Selection Status **/
#define PIOF_IFDGSR_P20		(1 << 20)
/** PIOF_IFDGSR_P19 Glitch or Debouncing Filter Selection Status **/
#define PIOF_IFDGSR_P19		(1 << 19)
/** PIOF_IFDGSR_P18 Glitch or Debouncing Filter Selection Status **/
#define PIOF_IFDGSR_P18		(1 << 18)
/** PIOF_IFDGSR_P17 Glitch or Debouncing Filter Selection Status **/
#define PIOF_IFDGSR_P17		(1 << 17)
/** PIOF_IFDGSR_P16 Glitch or Debouncing Filter Selection Status **/
#define PIOF_IFDGSR_P16		(1 << 16)
/** PIOF_IFDGSR_P15 Glitch or Debouncing Filter Selection Status **/
#define PIOF_IFDGSR_P15		(1 << 15)
/** PIOF_IFDGSR_P14 Glitch or Debouncing Filter Selection Status **/
#define PIOF_IFDGSR_P14		(1 << 14)
/** PIOF_IFDGSR_P13 Glitch or Debouncing Filter Selection Status **/
#define PIOF_IFDGSR_P13		(1 << 13)
/** PIOF_IFDGSR_P12 Glitch or Debouncing Filter Selection Status **/
#define PIOF_IFDGSR_P12		(1 << 12)
/** PIOF_IFDGSR_P11 Glitch or Debouncing Filter Selection Status **/
#define PIOF_IFDGSR_P11		(1 << 11)
/** PIOF_IFDGSR_P10 Glitch or Debouncing Filter Selection Status **/
#define PIOF_IFDGSR_P10		(1 << 10)
/** PIOF_IFDGSR_P9 Glitch or Debouncing Filter Selection Status **/
#define PIOF_IFDGSR_P9		(1 << 9)
/** PIOF_IFDGSR_P8 Glitch or Debouncing Filter Selection Status **/
#define PIOF_IFDGSR_P8		(1 << 8)
/** PIOF_IFDGSR_P7 Glitch or Debouncing Filter Selection Status **/
#define PIOF_IFDGSR_P7		(1 << 7)
/** PIOF_IFDGSR_P6 Glitch or Debouncing Filter Selection Status **/
#define PIOF_IFDGSR_P6		(1 << 6)
/** PIOF_IFDGSR_P5 Glitch or Debouncing Filter Selection Status **/
#define PIOF_IFDGSR_P5		(1 << 5)
/** PIOF_IFDGSR_P4 Glitch or Debouncing Filter Selection Status **/
#define PIOF_IFDGSR_P4		(1 << 4)
/** PIOF_IFDGSR_P3 Glitch or Debouncing Filter Selection Status **/
#define PIOF_IFDGSR_P3		(1 << 3)
/** PIOF_IFDGSR_P2 Glitch or Debouncing Filter Selection Status **/
#define PIOF_IFDGSR_P2		(1 << 2)
/** PIOF_IFDGSR_P1 Glitch or Debouncing Filter Selection Status **/
#define PIOF_IFDGSR_P1		(1 << 1)
/** PIOF_IFDGSR_P0 Glitch or Debouncing Filter Selection Status **/
#define PIOF_IFDGSR_P0		(1 << 0)

/**@}*/

/** @defgroup piof_scdr SCDR Slow Clock Divider Debouncing Register
@{*/


#define PIOF_SCDR_DIV_SHIFT		0
#define PIOF_SCDR_DIV_MASK		0x3fff
/** @defgroup piof_scdr_div DIV Slow Clock Divider Selection for Debouncing
@{*/
/**@}*/


/**@}*/

