grevaillot/svd_tools/headers/ATSAM3X8H/piof.h
/** PIOF_ELSR_P31 Edge/Level Interrupt source selection. **/
#define PIOF_ELSR_P31		(1 << 31)
/** PIOF_ELSR_P30 Edge/Level Interrupt source selection. **/
#define PIOF_ELSR_P30		(1 << 30)
/** PIOF_ELSR_P29 Edge/Level Interrupt source selection. **/
#define PIOF_ELSR_P29		(1 << 29)
/** PIOF_ELSR_P28 Edge/Level Interrupt source selection. **/
#define PIOF_ELSR_P28		(1 << 28)
/** PIOF_ELSR_P27 Edge/Level Interrupt source selection. **/
#define PIOF_ELSR_P27		(1 << 27)
/** PIOF_ELSR_P26 Edge/Level Interrupt source selection. **/
#define PIOF_ELSR_P26		(1 << 26)
/** PIOF_ELSR_P25 Edge/Level Interrupt source selection. **/
#define PIOF_ELSR_P25		(1 << 25)
/** PIOF_ELSR_P24 Edge/Level Interrupt source selection. **/
#define PIOF_ELSR_P24		(1 << 24)
/** PIOF_ELSR_P23 Edge/Level Interrupt source selection. **/
#define PIOF_ELSR_P23		(1 << 23)
/** PIOF_ELSR_P22 Edge/Level Interrupt source selection. **/
#define PIOF_ELSR_P22		(1 << 22)
/** PIOF_ELSR_P21 Edge/Level Interrupt source selection. **/
#define PIOF_ELSR_P21		(1 << 21)
/** PIOF_ELSR_P20 Edge/Level Interrupt source selection. **/
#define PIOF_ELSR_P20		(1 << 20)
/** PIOF_ELSR_P19 Edge/Level Interrupt source selection. **/
#define PIOF_ELSR_P19		(1 << 19)
/** PIOF_ELSR_P18 Edge/Level Interrupt source selection. **/
#define PIOF_ELSR_P18		(1 << 18)
/** PIOF_ELSR_P17 Edge/Level Interrupt source selection. **/
#define PIOF_ELSR_P17		(1 << 17)
/** PIOF_ELSR_P16 Edge/Level Interrupt source selection. **/
#define PIOF_ELSR_P16		(1 << 16)
/** PIOF_ELSR_P15 Edge/Level Interrupt source selection. **/
#define PIOF_ELSR_P15		(1 << 15)
/** PIOF_ELSR_P14 Edge/Level Interrupt source selection. **/
#define PIOF_ELSR_P14		(1 << 14)
/** PIOF_ELSR_P13 Edge/Level Interrupt source selection. **/
#define PIOF_ELSR_P13		(1 << 13)
/** PIOF_ELSR_P12 Edge/Level Interrupt source selection. **/
#define PIOF_ELSR_P12		(1 << 12)
/** PIOF_ELSR_P11 Edge/Level Interrupt source selection. **/
#define PIOF_ELSR_P11		(1 << 11)
/** PIOF_ELSR_P10 Edge/Level Interrupt source selection. **/
#define PIOF_ELSR_P10		(1 << 10)
/** PIOF_ELSR_P9 Edge/Level Interrupt source selection. **/
#define PIOF_ELSR_P9		(1 << 9)
/** PIOF_ELSR_P8 Edge/Level Interrupt source selection. **/
#define PIOF_ELSR_P8		(1 << 8)
/** PIOF_ELSR_P7 Edge/Level Interrupt source selection. **/
#define PIOF_ELSR_P7		(1 << 7)
/** PIOF_ELSR_P6 Edge/Level Interrupt source selection. **/
#define PIOF_ELSR_P6		(1 << 6)
/** PIOF_ELSR_P5 Edge/Level Interrupt source selection. **/
#define PIOF_ELSR_P5		(1 << 5)
/** PIOF_ELSR_P4 Edge/Level Interrupt source selection. **/
#define PIOF_ELSR_P4		(1 << 4)
/** PIOF_ELSR_P3 Edge/Level Interrupt source selection. **/
#define PIOF_ELSR_P3		(1 << 3)
/** PIOF_ELSR_P2 Edge/Level Interrupt source selection. **/
#define PIOF_ELSR_P2		(1 << 2)
/** PIOF_ELSR_P1 Edge/Level Interrupt source selection. **/
#define PIOF_ELSR_P1		(1 << 1)
/** PIOF_ELSR_P0 Edge/Level Interrupt source selection. **/
#define PIOF_ELSR_P0		(1 << 0)

/**@}*/

/** @defgroup piof_fellsr FELLSR Falling Edge/Low Level Select Register
@{*/

/** PIOF_FELLSR_P31 Falling Edge/Low Level Interrupt Selection. **/
#define PIOF_FELLSR_P31		(1 << 31)
/** PIOF_FELLSR_P30 Falling Edge/Low Level Interrupt Selection. **/
#define PIOF_FELLSR_P30		(1 << 30)
/** PIOF_FELLSR_P29 Falling Edge/Low Level Interrupt Selection. **/
#define PIOF_FELLSR_P29		(1 << 29)
/** PIOF_FELLSR_P28 Falling Edge/Low Level Interrupt Selection. **/
#define PIOF_FELLSR_P28		(1 << 28)
/** PIOF_FELLSR_P27 Falling Edge/Low Level Interrupt Selection. **/
#define PIOF_FELLSR_P27		(1 << 27)
/** PIOF_FELLSR_P26 Falling Edge/Low Level Interrupt Selection. **/
#define PIOF_FELLSR_P26		(1 << 26)
/** PIOF_FELLSR_P25 Falling Edge/Low Level Interrupt Selection. **/
#define PIOF_FELLSR_P25		(1 << 25)
/** PIOF_FELLSR_P24 Falling Edge/Low Level Interrupt Selection. **/
#define PIOF_FELLSR_P24		(1 << 24)
/** PIOF_FELLSR_P23 Falling Edge/Low Level Interrupt Selection. **/
#define PIOF_FELLSR_P23		(1 << 23)
/** PIOF_FELLSR_P22 Falling Edge/Low Level Interrupt Selection. **/
#define PIOF_FELLSR_P22		(1 << 22)
/** PIOF_FELLSR_P21 Falling Edge/Low Level Interrupt Selection. **/
#define PIOF_FELLSR_P21		(1 << 21)
/** PIOF_FELLSR_P20 Falling Edge/Low Level Interrupt Selection. **/
#define PIOF_FELLSR_P20		(1 << 20)
/** PIOF_FELLSR_P19 Falling Edge/Low Level Interrupt Selection. **/
#define PIOF_FELLSR_P19		(1 << 19)
/** PIOF_FELLSR_P18 Falling Edge/Low Level Interrupt Selection. **/
#define PIOF_FELLSR_P18		(1 << 18)
/** PIOF_FELLSR_P17 Falling Edge/Low Level Interrupt Selection. **/
#define PIOF_FELLSR_P17		(1 << 17)
/** PIOF_FELLSR_P16 Falling Edge/Low Level Interrupt Selection. **/
#define PIOF_FELLSR_P16		(1 << 16)
/** PIOF_FELLSR_P15 Falling Edge/Low Level Interrupt Selection. **/
#define PIOF_FELLSR_P15		(1 << 15)
/** PIOF_FELLSR_P14 Falling Edge/Low Level Interrupt Selection. **/
#define PIOF_FELLSR_P14		(1 << 14)
/** PIOF_FELLSR_P13 Falling Edge/Low Level Interrupt Selection. **/
#define PIOF_FELLSR_P13		(1 << 13)
/** PIOF_FELLSR_P12 Falling Edge/Low Level Interrupt Selection. **/
#define PIOF_FELLSR_P12		(1 << 12)
/** PIOF_FELLSR_P11 Falling Edge/Low Level Interrupt Selection. **/
#define PIOF_FELLSR_P11		(1 << 11)
/** PIOF_FELLSR_P10 Falling Edge/Low Level Interrupt Selection. **/
#define PIOF_FELLSR_P10		(1 << 10)
/** PIOF_FELLSR_P9 Falling Edge/Low Level Interrupt Selection. **/
#define PIOF_FELLSR_P9		(1 << 9)
/** PIOF_FELLSR_P8 Falling Edge/Low Level Interrupt Selection. **/
#define PIOF_FELLSR_P8		(1 << 8)
/** PIOF_FELLSR_P7 Falling Edge/Low Level Interrupt Selection. **/
#define PIOF_FELLSR_P7		(1 << 7)
/** PIOF_FELLSR_P6 Falling Edge/Low Level Interrupt Selection. **/
#define PIOF_FELLSR_P6		(1 << 6)
/** PIOF_FELLSR_P5 Falling Edge/Low Level Interrupt Selection. **/
#define PIOF_FELLSR_P5		(1 << 5)
/** PIOF_FELLSR_P4 Falling Edge/Low Level Interrupt Selection. **/
#define PIOF_FELLSR_P4		(1 << 4)
/** PIOF_FELLSR_P3 Falling Edge/Low Level Interrupt Selection. **/
#define PIOF_FELLSR_P3		(1 << 3)
/** PIOF_FELLSR_P2 Falling Edge/Low Level Interrupt Selection. **/
#define PIOF_FELLSR_P2		(1 << 2)
/** PIOF_FELLSR_P1 Falling Edge/Low Level Interrupt Selection. **/
#define PIOF_FELLSR_P1		(1 << 1)
/** PIOF_FELLSR_P0 Falling Edge/Low Level Interrupt Selection. **/
#define PIOF_FELLSR_P0		(1 << 0)

/**@}*/

/** @defgroup piof_rehlsr REHLSR Rising Edge/ High Level Select Register
@{*/

/** PIOF_REHLSR_P31 Rising Edge /High Level Interrupt Selection. **/
#define PIOF_REHLSR_P31		(1 << 31)
/** PIOF_REHLSR_P30 Rising Edge /High Level Interrupt Selection. **/
#define PIOF_REHLSR_P30		(1 << 30)
/** PIOF_REHLSR_P29 Rising Edge /High Level Interrupt Selection. **/
#define PIOF_REHLSR_P29		(1 << 29)
/** PIOF_REHLSR_P28 Rising Edge /High Level Interrupt Selection. **/
#define PIOF_REHLSR_P28		(1 << 28)
/** PIOF_REHLSR_P27 Rising Edge /High Level Interrupt Selection. **/
#define PIOF_REHLSR_P27		(1 << 27)
/** PIOF_REHLSR_P26 Rising Edge /High Level Interrupt Selection. **/
#define PIOF_REHLSR_P26		(1 << 26)
/** PIOF_REHLSR_P25 Rising Edge /High Level Interrupt Selection. **/
#define PIOF_REHLSR_P25		(1 << 25)
/** PIOF_REHLSR_P24 Rising Edge /High Level Interrupt Selection. **/
#define PIOF_REHLSR_P24		(1 << 24)
/** PIOF_REHLSR_P23 Rising Edge /High Level Interrupt Selection. **/
#define PIOF_REHLSR_P23		(1 << 23)
/** PIOF_REHLSR_P22 Rising Edge /High Level Interrupt Selection. **/
#define PIOF_REHLSR_P22		(1 << 22)
/** PIOF_REHLSR_P21 Rising Edge /High Level Interrupt Selection. **/
#define PIOF_REHLSR_P21		(1 << 21)
/** PIOF_REHLSR_P20 Rising Edge /High Level Interrupt Selection. **/
#define PIOF_REHLSR_P20		(1 << 20)
/** PIOF_REHLSR_P19 Rising Edge /High Level Interrupt Selection. **/
#define PIOF_REHLSR_P19		(1 << 19)
/** PIOF_REHLSR_P18 Rising Edge /High Level Interrupt Selection. **/
#define PIOF_REHLSR_P18		(1 << 18)
/** PIOF_REHLSR_P17 Rising Edge /High Level Interrupt Selection. **/
#define PIOF_REHLSR_P17		(1 << 17)
/** PIOF_REHLSR_P16 Rising Edge /High Level Interrupt Selection. **/
#define PIOF_REHLSR_P16		(1 << 16)
/** PIOF_REHLSR_P15 Rising Edge /High Level Interrupt Selection. **/
#define PIOF_REHLSR_P15		(1 << 15)
/** PIOF_REHLSR_P14 Rising Edge /High Level Interrupt Selection. **/
#define PIOF_REHLSR_P14		(1 << 14)
/** PIOF_REHLSR_P13 Rising Edge /High Level Interrupt Selection. **/
#define PIOF_REHLSR_P13		(1 << 13)
/** PIOF_REHLSR_P12 Rising Edge /High Level Interrupt Selection. **/
#define PIOF_REHLSR_P12		(1 << 12)
/** PIOF_REHLSR_P11 Rising Edge /High Level Interrupt Selection. **/
#define PIOF_REHLSR_P11		(1 << 11)
/** PIOF_REHLSR_P10 Rising Edge /High Level Interrupt Selection. **/
#define PIOF_REHLSR_P10		(1 << 10)
/** PIOF_REHLSR_P9 Rising Edge /High Level Interrupt Selection. **/
#define PIOF_REHLSR_P9		(1 << 9)
/** PIOF_REHLSR_P8 Rising Edge /High Level Interrupt Selection. **/
#define PIOF_REHLSR_P8		(1 << 8)
/** PIOF_REHLSR_P7 Rising Edge /High Level Interrupt Selection. **/
#define PIOF_REHLSR_P7		(1 << 7)
/** PIOF_REHLSR_P6 Rising Edge /High Level Interrupt Selection. **/
#define PIOF_REHLSR_P6		(1 << 6)
/** PIOF_REHLSR_P5 Rising Edge /High Level Interrupt Selection. **/
#define PIOF_REHLSR_P5		(1 << 5)
/** PIOF_REHLSR_P4 Rising Edge /High Level Interrupt Selection. **/
#define PIOF_REHLSR_P4		(1 << 4)
/** PIOF_REHLSR_P3 Rising Edge /High Level Interrupt Selection. **/
#define PIOF_REHLSR_P3		(1 << 3)
/** PIOF_REHLSR_P2 Rising Edge /High Level Interrupt Selection. **/
#define PIOF_REHLSR_P2		(1 << 2)
/** PIOF_REHLSR_P1 Rising Edge /High Level Interrupt Selection. **/
#define PIOF_REHLSR_P1		(1 << 1)
/** PIOF_REHLSR_P0 Rising Edge /High Level Interrupt Selection. **/
#define PIOF_REHLSR_P0		(1 << 0)

/**@}*/

/** @defgroup piof_frlhsr FRLHSR Fall/Rise - Low/High Status Register
@{*/

/** PIOF_FRLHSR_P31 Edge /Level Interrupt Source Selection. **/
#define PIOF_FRLHSR_P31		(1 << 31)
/** PIOF_FRLHSR_P30 Edge /Level Interrupt Source Selection. **/
#define PIOF_FRLHSR_P30		(1 << 30)
/** PIOF_FRLHSR_P29 Edge /Level Interrupt Source Selection. **/
#define PIOF_FRLHSR_P29		(1 << 29)
/** PIOF_FRLHSR_P28 Edge /Level Interrupt Source Selection. **/
#define PIOF_FRLHSR_P28		(1 << 28)
/** PIOF_FRLHSR_P27 Edge /Level Interrupt Source Selection. **/
#define PIOF_FRLHSR_P27		(1 << 27)
/** PIOF_FRLHSR_P26 Edge /Level Interrupt Source Selection. **/
#define PIOF_FRLHSR_P26		(1 << 26)
/** PIOF_FRLHSR_P25 Edge /Level Interrupt Source Selection. **/
#define PIOF_FRLHSR_P25		(1 << 25)
/** PIOF_FRLHSR_P24 Edge /Level Interrupt Source Selection. **/
#define PIOF_FRLHSR_P24		(1 << 24)
/** PIOF_FRLHSR_P23 Edge /Level Interrupt Source Selection. **/
#define PIOF_FRLHSR_P23		(1 << 23)
/** PIOF_FRLHSR_P22 Edge /Level Interrupt Source Selection. **/
#define PIOF_FRLHSR_P22		(1 << 22)
/** PIOF_FRLHSR_P21 Edge /Level Interrupt Source Selection. **/
#define PIOF_FRLHSR_P21		(1 << 21)
/** PIOF_FRLHSR_P20 Edge /Level Interrupt Source Selection. **/
#define PIOF_FRLHSR_P20		(1 << 20)
/** PIOF_FRLHSR_P19 Edge /Level Interrupt Source Selection. **/
#define PIOF_FRLHSR_P19		(1 << 19)
/** PIOF_FRLHSR_P18 Edge /Level Interrupt Source Selection. **/
#define PIOF_FRLHSR_P18		(1 << 18)
/** PIOF_FRLHSR_P17 Edge /Level Interrupt Source Selection. **/
#define PIOF_FRLHSR_P17		(1 << 17)
/** PIOF_FRLHSR_P16 Edge /Level Interrupt Source Selection. **/
#define PIOF_FRLHSR_P16		(1 << 16)
/** PIOF_FRLHSR_P15 Edge /Level Interrupt Source Selection. **/
#define PIOF_FRLHSR_P15		(1 << 15)
/** PIOF_FRLHSR_P14 Edge /Level Interrupt Source Selection. **/
#define PIOF_FRLHSR_P14		(1 << 14)
/** PIOF_FRLHSR_P13 Edge /Level Interrupt Source Selection. **/
#define PIOF_FRLHSR_P13		(1 << 13)
/** PIOF_FRLHSR_P12 Edge /Level Interrupt Source Selection. **/
#define PIOF_FRLHSR_P12		(1 << 12)
/** PIOF_FRLHSR_P11 Edge /Level Interrupt Source Selection. **/
#define PIOF_FRLHSR_P11		(1 << 11)
/** PIOF_FRLHSR_P10 Edge /Level Interrupt Source Selection. **/
#define PIOF_FRLHSR_P10		(1 << 10)
/** PIOF_FRLHSR_P9 Edge /Level Interrupt Source Selection. **/
#define PIOF_FRLHSR_P9		(1 << 9)
/** PIOF_FRLHSR_P8 Edge /Level Interrupt Source Selection. **/
#define PIOF_FRLHSR_P8		(1 << 8)
/** PIOF_FRLHSR_P7 Edge /Level Interrupt Source Selection. **/
#define PIOF_FRLHSR_P7		(1 << 7)
/** PIOF_FRLHSR_P6 Edge /Level Interrupt Source Selection. **/
#define PIOF_FRLHSR_P6		(1 << 6)
/** PIOF_FRLHSR_P5 Edge /Level Interrupt Source Selection. **/
#define PIOF_FRLHSR_P5		(1 << 5)
/** PIOF_FRLHSR_P4 Edge /Level Interrupt Source Selection. **/
#define PIOF_FRLHSR_P4		(1 << 4)
/** PIOF_FRLHSR_P3 Edge /Level Interrupt Source Selection. **/
#define PIOF_FRLHSR_P3		(1 << 3)
/** PIOF_FRLHSR_P2 Edge /Level Interrupt Source Selection. **/
#define PIOF_FRLHSR_P2		(1 << 2)
/** PIOF_FRLHSR_P1 Edge /Level Interrupt Source Selection. **/
#define PIOF_FRLHSR_P1		(1 << 1)
/** PIOF_FRLHSR_P0 Edge /Level Interrupt Source Selection. **/
#define PIOF_FRLHSR_P0		(1 << 0)

/**@}*/

/** @defgroup piof_locksr LOCKSR Lock Status
@{*/

/** PIOF_LOCKSR_P31 Lock Status. **/
#define PIOF_LOCKSR_P31		(1 << 31)
/** PIOF_LOCKSR_P30 Lock Status. **/
#define PIOF_LOCKSR_P30		(1 << 30)
/** PIOF_LOCKSR_P29 Lock Status. **/
#define PIOF_LOCKSR_P29		(1 << 29)
/** PIOF_LOCKSR_P28 Lock Status. **/
#define PIOF_LOCKSR_P28		(1 << 28)
/** PIOF_LOCKSR_P27 Lock Status. **/
#define PIOF_LOCKSR_P27		(1 << 27)
/** PIOF_LOCKSR_P26 Lock Status. **/
#define PIOF_LOCKSR_P26		(1 << 26)
/** PIOF_LOCKSR_P25 Lock Status. **/
#define PIOF_LOCKSR_P25		(1 << 25)
/** PIOF_LOCKSR_P24 Lock Status. **/
#define PIOF_LOCKSR_P24		(1 << 24)
/** PIOF_LOCKSR_P23 Lock Status. **/
#define PIOF_LOCKSR_P23		(1 << 23)
/** PIOF_LOCKSR_P22 Lock Status. **/
#define PIOF_LOCKSR_P22		(1 << 22)
/** PIOF_LOCKSR_P21 Lock Status. **/
#define PIOF_LOCKSR_P21		(1 << 21)
/** PIOF_LOCKSR_P20 Lock Status. **/
#define PIOF_LOCKSR_P20		(1 << 20)
/** PIOF_LOCKSR_P19 Lock Status. **/
#define PIOF_LOCKSR_P19		(1 << 19)
/** PIOF_LOCKSR_P18 Lock Status. **/
#define PIOF_LOCKSR_P18		(1 << 18)
/** PIOF_LOCKSR_P17 Lock Status. **/
#define PIOF_LOCKSR_P17		(1 << 17)
/** PIOF_LOCKSR_P16 Lock Status. **/
#define PIOF_LOCKSR_P16		(1 << 16)
/** PIOF_LOCKSR_P15 Lock Status. **/
#define PIOF_LOCKSR_P15		(1 << 15)
/** PIOF_LOCKSR_P14 Lock Status. **/
#define PIOF_LOCKSR_P14		(1 << 14)
/** PIOF_LOCKSR_P13 Lock Status. **/
#define PIOF_LOCKSR_P13		(1 << 13)
/** PIOF_LOCKSR_P12 Lock Status. **/
#define PIOF_LOCKSR_P12		(1 << 12)
/** PIOF_LOCKSR_P11 Lock Status. **/
#define PIOF_LOCKSR_P11		(1 << 11)
/** PIOF_LOCKSR_P10 Lock Status. **/
#define PIOF_LOCKSR_P10		(1 << 10)
/** PIOF_LOCKSR_P9 Lock Status. **/
#define PIOF_LOCKSR_P9		(1 << 9)
/** PIOF_LOCKSR_P8 Lock Status. **/
#define PIOF_LOCKSR_P8		(1 << 8)
/** PIOF_LOCKSR_P7 Lock Status. **/
#define PIOF_LOCKSR_P7		(1 << 7)
/** PIOF_LOCKSR_P6 Lock Status. **/
#define PIOF_LOCKSR_P6		(1 << 6)
/** PIOF_LOCKSR_P5 Lock Status. **/
#define PIOF_LOCKSR_P5		(1 << 5)
/** PIOF_LOCKSR_P4 Lock Status. **/
#define PIOF_LOCKSR_P4		(1 << 4)
/** PIOF_LOCKSR_P3 Lock Status. **/
#define PIOF_LOCKSR_P3		(1 << 3)
/** PIOF_LOCKSR_P2 Lock Status. **/
#define PIOF_LOCKSR_P2		(1 << 2)
/** PIOF_LOCKSR_P1 Lock Status. **/
#define PIOF_LOCKSR_P1		(1 << 1)
/** PIOF_LOCKSR_P0 Lock Status. **/
#define PIOF_LOCKSR_P0		(1 << 0)

/**@}*/

/** @defgroup piof_wpmr WPMR Write Protect Mode Register
@{*/


#define PIOF_WPMR_WPKEY_SHIFT		8
#define PIOF_WPMR_WPKEY_MASK		0xffffff
/** @defgroup piof_wpmr_wpkey WPKEY Write Protect KEY
@{*/
/**@}*/

/** PIOF_WPMR_WPEN Write Protect Enable **/
#define PIOF_WPMR_WPEN		(1 << 0)

/**@}*/

/** @defgroup piof_wpsr WPSR Write Protect Status Register
@{*/


#define PIOF_WPSR_WPVSRC_SHIFT		8
#define PIOF_WPSR_WPVSRC_MASK		0xffff
/** @defgroup piof_wpsr_wpvsrc WPVSRC Write Protect Violation Source
@{*/
/**@}*/

/** PIOF_WPSR_WPVS Write Protect Violation Status **/
#define PIOF_WPSR_WPVS		(1 << 0)

/**@}*/
